classes = {
"5": "АБВГД",
"6": "АБВГМ",
"7": "АБВГМ",
"8": "АБВГДМ",
"9": "АБВГД",
"10": "АБВГ",
"11": "АБВ"
}
teachers = ["Абашева С.Г.",
"Ангурян И.А.",
"Андреева С.Е.",
"Аристов Ю.А.",
"Безматерных Е.И.",
"Богатырёва Д.Н.",
"Вахрушева К.О.",
"Волкова Л.В.",
"Вохмина Т.А.",
"Гайнатуллина М.В.",
"Генералова Н.В.",
"Глазкова Л.В.",
"Гуляева А.Р.",
"Даулетов Д.Р.",
"Документова Ю.С",
"Зорина Е.А.",
"Иванов А.В.",
"Иванова Т.Э.",
"Исангильдинова Ю.А.",
"Ишпаев А.А.",
"Канакова Е.Р.",
"Кологерманская А.Н.",
"Корнилова Н.С.",
"Коротаева Е.В.",
"Кошикова А.С.",
"Кудрина И.М.",
"Кузнецов С.С.",
"Кырова Н.Н.",
"Лобанова Т.В.",
"Логунова Т.Ю.",
"Ломаева И.С.",
"Лялина Е.В.",
"Миловидов С.Г.",
"Молчанова Е.И.",
"Нафиков Р.М.",
"Перевозчикова Е.С.",
"Петрушко Н.Н.",
"Платонова Е.В.",
"Прокопьева Т.В.",
"Пушкарёва Л.В.",
"Радыгина С.В.",
"Рубинштейн И.Э.",
"Рудская Т.А.",
"Северюхина И.Л.",
"Сивкова Л.М.",
"Смехнова М.В.",
"Столова Е.А.",
"Суслов А.А.",
"Сычева Е.В.",
"Тенсина Е.А.",
"Фисенко И.Н.",
"Хакимов М.Т.",
"Холмогорова Е.В.",
"Чиркова М.Ю.",
"Шатунова Н.Е.",
"Шишова М.И.",
"Щампаров"]
from bot.DB import DB
import json

database = DB({
    "user": "root",
    "password": "Qwerty5432",
    "host": "localhost",
    "database": "schedule86",
    "port": 5000
})
schedule = {"standart": {"ПОНЕДЕЛЬНИК": [], "ВТОРНИК": [], "СРЕДА": [], "ЧЕТВЕРГ": [], "ПЯТНИЦА": [], "СУББОТА": []}, "edited": {}}

data = []

for parallel in classes:
  for symbol in classes[parallel]:
    database.query("INSERT INTO schedule_classes (`parallel`, `symbol`, `schedule`, `subscribe`) VALUE (%s, %s, %s, %s)", [parallel, symbol, json.dumps(schedule), "[]"])
